<?php
include "app/session.php";
include "index.php";
?>
<aside>
    <div class="reg_form_log">
        <h3>Авторизуйтесь</h3>
        <form method="post" action="About.php">
            <p>Введите имя</p>
            <input type="text" name="log_name">
            <p>Введите email</p>
            <input type="text" name="log_email">
            <input type="submit" name="login" value="Войти">
        </form>
    </div>
</aside>
    <main>
        <p>Блог (англ. blog, от web log — интернет-журнал событий, интернет-дневник, онлайн-дневник) — веб-сайт, основное содержимое которого — регулярно добавляемые записи, содержащие текст, изображения или мультимедиа.
Для блогов характерны недлинные записи вре́менной значимости, упорядоченные в обратном хронологическом порядке (последняя запись сверху).
Отличия блога от традиционного дневника обусловливаются средой: блоги обычно публичны и предполагают сторонних читателей, которые могут вступить в публичную полемику с автором (в комментарии к блогозаписи или своих блогах).
Людей, ведущих блог, называют бло́герами. Совокупность всех блогов Сети принято называть блогосферой.
Для блогов характерна возможность публикации отзывов (комментариев) посетителями. Она делает блоги средой сетевого общения, имеющей ряд преимуществ перед электронной почтой, группами новостей, веб-форумами и чатами.
Под блогами также понимаются персональные сайты, которые состоят в основном из личных записей владельца блога и комментариев пользователей к этим записям.
Первым блогом считается страница Тима Бернерса-Ли, где он, начиная с 1992 г., публиковал новости. Более широкое рас­пространение блоги получили с 1996 г.
В августе 1999 г. компью­терная компания Pyra Labs из Сан-Франциско открыла сайт Blogger.com, который стал первой бесплатной блоговой службой.
В настоящее время особенность блогов заключается не только в структуре записей, но и в простоте добавления новых записей. Пользователь просто обращается к веб-серверу, прохо­дит процесс идентификации пользователя, после чего он добавляет новую запись к своей коллекции.Сервер представляет инфор­мацию как последовательность сообщений, помещая в самом верху самые свежие сообщения.
    Структура коллекции напоми­нает привычную последовательную структуру дневника или журнала.</p>.
    </main>